# DataFram Map

In [8]:
import pandas as pd
data = {'first_name': ['Jack','Meena', 'Sudhir', 'Amy','Leena'],
       'age':[23,56,75,12,18],
       'city':['Mumbai','Boston','Sydney','Boston','Delhi']}
df = pd.DataFrame(data, columns = ['first_name', 'age', 'city'])

In [10]:
city_to_country = {'Mumbai' : 'India',
                  'Boston' : 'USA',
                  'Sydney' : 'Australia',
                  'Boston' : 'USA',
                  'Delhi' : 'India'}
df

  first_name  age    city
0       Jack   23  Mumbai
1      Meena   56  Boston
2     Sudhir   75  Sydney
3        Amy   12  Boston
4      Leena   18   Delhi

# Map = Iterates over each element

  first_name  age    city    country
0       Jack   23  Mumbai      India
1      Meena   56  Boston        USA
2     Sudhir   75  Sydney  Australia
3        Amy   12  Boston        USA
4      Leena   18   Delhi      India

# 1. Map dicitionary object to one column

In [ ]:
df['country'] = df['city'].map(city_to_country)
df

# 2. Map first_name to new first_name

In [14]:
df['new_first_name'] = df['first_name'].map(lambda x: 'new_'+x)
df

  first_name  age    city    country new_first_name
0       Jack   23  Mumbai      India       new_Jack
1      Meena   56  Boston        USA      new_Meena
2     Sudhir   75  Sydney  Australia     new_Sudhir
3        Amy   12  Boston        USA        new_Amy
4      Leena   18   Delhi      India      new_Leena

# 3. Map age to new Age

In [16]:
df['new_age'] = df['age'].map(lambda x: x+5)
df

  first_name  age    city    country new_first_name  new_age
0       Jack   23  Mumbai      India       new_Jack       28
1      Meena   56  Boston        USA      new_Meena       61
2     Sudhir   75  Sydney  Australia     new_Sudhir       80
3        Amy   12  Boston        USA        new_Amy       17
4      Leena   18   Delhi      India      new_Leena       23